{
  "header": {
    "name": "Rodrigo Militão",
    "description": "Senior Software Engineer based in Brasil",
    "imgPath": "https://raw.githubusercontent.com/rodrigo-militao/rodrigo-militao.github.io/main/src/assets/Rodrigo2.jpeg",
    "resumePath": "https://raw.githubusercontent.com/rodrigo-militao/rodrigo-militao.github.io/main/src/assets/RodrigoMilitaoCurriculum.pdf",
    "links": [
      {
      "name": "LinkedIn",
      "link": "https://linkedin.com/in/rodrigo-militao/"
    },{
      "name": "Github",
      "link": "https://github.com/rodrigo-militao/"
    },{
      "name": "+55 (81) 98349-5469",
      "link": "tel: +5581983495469"
    },{
      "name": "LeetCode",
      "link": "https://leetcode.com/rodrigo-militao/"
    }]
  },
  "sections": [
    {
      "name": "ABOUT ME",
      "content":[
        {
          "name": "",
          "link": "",
          "text": "👨‍💻️ I'm a Software Engineer with over 5 years of experience developing Java, C# and NodeJS applications and microservices for high-scale environments (5M+ users). Specialist in Java, Spring Framework, C#, .NET, Typescript, NodeJS,  Docker, Kubernetes, AWS, SQL, and microservices architecture. Strong background in Agile teams (Scrum), with a focus on delivering robust, scalable, and high-performance solutions. Experienced in continuous integration (CI/CD), messaging systems (Kafka, RabbitMQ), and software quality and testing practices. Familiar with data privacy principles and risk management strategies. Advanced fluent English (C1) for technical communication and international collaboration."
        }
      ]
    },
    {
      "name": "EXPERIENCE",
      "content":[
        {
          "name": "Bradesco (Aug 2024 - Present)",
          "link": "",
          "text": "As a Senior Software Engineer, Develop microservices for a Cards ecosystem serving 5M+ users, using Git, REST APIs, Java, SpringBoot, Kafka, SQL Server, MongoDB, Github Actions and Azure in Angile teams (Scrum). Optimize real-time processing with Azure and MongoDB, improving reliability"
        },
        {
          "name": "XP Inc. (Aug 2021 - Aug 2024)",
          "link": "",
          "text": "I worked as Backend Software Engineer, in the company's Cards ecosystem that has more than 400 thousand active users. Main responsibilities consist of maintaining various .NET Microservices in a distributed architecture that communicate using Apache Kafka with Azure Event Hubs, as well as Datadog for logging and Docker for working with containerized applications."
        },
        {
          "name": "Oi S.A (Dez 2020 - Aug 2021)",
          "link": "",
          "text": "I worked as a Full Stack web developer, I was a member of the company's Profitability team. Main activities: Full Stack Web Development, elaboration and development of flows, screens, functionalities and improvements for customers. Using technologies such as: ReactJS, NodeJs, Redis, MongoDB, Jenkins, Git, Docker."
        }
      ]
    },
    {
      "name": "SKILLS",
      "content": [
        {
          "name": "Languages & Frameworks",
          "link": "",
          "text": "Java, C#, .NET, JavaScript, Typescript, Node.js, Express.js, React, AngularJS."
        },
        {
          "name": "Databases",
          "link": "",
          "text": "MongoDB, Redis, PostgreSQL, MySQL, SQL Server."
        },
        {
          "name": "Other",
          "link": "",
          "text": "Docker, CI/CD (Jenkins, Github Actions), Microservices, API design, RESTful APIs, Agile/Scrum, Kafka, RabbitMq."
        }
      ]
    }
  ]
}
